# Todays Agenda

In [ ]:
- pandas
   --> Series
   --> data frames

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.1.3'

In [4]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p16', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [5]:
print(len(dir(pd)))

140

# pandas series

## Hands on

In [6]:
import pandas as pd
import numpy as np

In [7]:
mydata=np.arange(30,100)
print(mydata)

[30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53
 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77
 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99]

In [8]:
mydata=np.arange(30,100,10)
print(mydata)

[30 40 50 60 70 80 90]

In [9]:
mypop_data=pd.Series(mydata)
print(mypop_data)

0    30
1    40
2    50
3    60
4    70
5    80
6    90
dtype: int32

In [10]:
mypop_data.name="population"

In [11]:
mypop_data.name

'population'

In [13]:
mypop_data[4]

70

In [ ]:
mypop_data[1:4]

In [ ]:
mypop_data1[1:7:2]

In [ ]:
mypop_data[::4]

In [15]:
g7_pop=pd.Series([63.95,10.94,35.63,72.99,41.49])

In [16]:
g7_pop.values

array([63.95, 10.94, 35.63, 72.99, 41.49])

In [17]:
type(g7_pop.index)

pandas.core.indexes.range.RangeIndex

In [21]:
g7_pop.index=['a','b','c','d','e']
g7_pop

a    63.95
b    10.94
c    35.63
d    72.99
e    41.49
dtype: float64

In [22]:
mypop_data=pd.Series([63.95,10.94,35.63,72.99,41.49])

In [24]:
mypop_data.index=['canada','united States','India','France','SriLanka']
mypop_data

canada           63.95
united States    10.94
India            35.63
France           72.99
SriLanka         41.49
dtype: float64

In [25]:
import pandas as pd

In [26]:
import numpy as np

In [31]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=[1,2,3,4,5,6])

In [32]:
r

1    1
2    2
3    3
4    4
5    5
6    6
dtype: int32

In [33]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=['a','b','c','d','e','h'])

In [34]:
r

a    1
b    2
c    3
d    4
e    5
h    6
dtype: int32

In [35]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=['mamtha','ram','chinthapalli','sai','sri','durga'])
r

mamtha          1
ram             2
chinthapalli    3
sai             4
sri             5
durga           6
dtype: int32

In [37]:
help(np)

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

In [3]:
import pandas as pd
import numpy as np
r=pd.Series(np.array([1,2,3,4,5,6]),index=['a','b','c','d','e','h'],name='roll no')
r

a    1
b    2
c    3
d    4
e    5
h    6
Name: roll no, dtype: int32

In [4]:
r

a    1
b    2
c    3
d    4
e    5
h    6
Name: roll no, dtype: int32

In [6]:
d={'a1':69,'a2':74,'a3':95,'a4':100,'a5':32}
d.items()

dict_items([('a1', 69), ('a2', 74), ('a3', 95), ('a4', 100), ('a5', 32)])

In [7]:
marks=pd.Series(d,name='S Marks')
marks

a1     69
a2     74
a3     95
a4    100
a5     32
Name: S Marks, dtype: int64

In [8]:
marks=pd.Series(d,name='S Marks',dtype='str')
marks

a1     69
a2     74
a3     95
a4    100
a5     32
Name: S Marks, dtype: object

In [9]:
marks['a2']

'74'

In [12]:
marks[['a2','a1']]

a2    74
a1    69
Name: S Marks, dtype: object

In [14]:
marks['a2':'a4']

a2     74
a3     95
a4    100
Name: S Marks, dtype: object

In [15]:
# iloc -it defines index values
## location - it defines index positions
marks

a1     69
a2     74
a3     95
a4    100
a5     32
Name: S Marks, dtype: object

In [16]:
marks.loc['a4']

'100'

In [18]:
marks.iloc[0]

'69'

In [19]:
marks.iloc[0:4]

a1     69
a2     74
a3     95
a4    100
Name: S Marks, dtype: object

In [20]:
marks.loc['a1':'a4']

a1     69
a2     74
a3     95
a4    100
Name: S Marks, dtype: object

In [21]:
import random

In [24]:
random.randint(1,10)

4

In [27]:
b=pd.Series(np.array([1,2,3,4,5,9,8]),index=list('ABCDEFG'),name='grades')
b

A    1
B    2
C    3
D    4
E    5
F    9
G    8
Name: grades, dtype: int32

In [28]:
b>6

A    False
B    False
C    False
D    False
E    False
F     True
G     True
Name: grades, dtype: bool

In [30]:
b[b>6]

F    9
G    8
Name: grades, dtype: int32

In [31]:
b*6

A     6
B    12
C    18
D    24
E    30
F    54
G    48
Name: grades, dtype: int32

In [32]:
# statistical operator
b.mean()

4.571428571428571

In [33]:
b['A':'c'].mean()

4.571428571428571

In [35]:
b['A']=23
b

A    23
B     2
C     3
D     4
E     5
F     9
G     8
Name: grades, dtype: int32

- probably the most important data structure of pandas is the DataFrame its a tabular structure tightly integrated with series

In [52]:
ms_marks={'sub1':[99,90,98,83,85,68,79,85,87,45],
          'sub2':[99,78,89,56,34,68,90,78,56,42],
          'sub3':[3,4,5,2,3,7,8,4,2,0,],
          'sub4':[98,90,78,89,67,45,32,67,76,45]}

In [53]:
marks=pd.DataFrame(ms_marks,index=['kunu','teju','durga','sushma','tripura','brahma','siva','vishnu','lakshmi','parvathi'])
marks

          sub1  sub2  sub3  sub4
kunu        99    99     3    98
teju        90    78     4    90
durga       98    89     5    78
sushma      83    56     2    89
tripura     85    34     3    67
brahma      68    68     7    45
siva        79    90     8    32
vishnu      85    78     4    67
lakshmi     87    56     2    76
parvathi    45    42     0    45

In [43]:
marks.loc['sushma'].sum()

230

In [44]:
marks.index

Index(['kunu', 'teju', 'durga', 'sushma', 'tripura', 'brahma', 'siva',
       'vishnu', 'lakshmi', 'parvathi'],
      dtype='object')

In [46]:
marks.columns

Index(['sub', 'sub2', 'sub3', 'sub4'], dtype='object')

In [47]:
marks.shape

(10, 4)

In [48]:
marks.describe()

             sub      sub2       sub3       sub4
count  10.000000  10.00000  10.000000  10.000000
mean   81.900000  69.00000   3.800000  68.700000
std    15.730014  21.59218   2.394438  21.959812
min    45.000000  34.00000   0.000000  32.000000
25%    80.000000  56.00000   2.250000  50.500000
50%    85.000000  73.00000   3.500000  71.500000
75%    89.250000  86.25000   4.750000  86.250000
max    99.000000  99.00000   8.000000  98.000000

In [54]:
marks['sub1']

kunu        99
teju        90
durga       98
sushma      83
tripura     85
brahma      68
siva        79
vishnu      85
lakshmi     87
parvathi    45
Name: sub1, dtype: int64

In [56]:
marks[['sub1','sub2']]

          sub1  sub2
kunu        99    99
teju        90    78
durga       98    89
sushma      83    56
tripura     85    34
brahma      68    68
siva        79    90
vishnu      85    78
lakshmi     87    56
parvathi    45    42

In [62]:
marks[marks>70]

          sub1  sub2  sub3  sub4
kunu      99.0  99.0   NaN  98.0
teju      90.0  78.0   NaN  90.0
durga     98.0  89.0   NaN  78.0
sushma    83.0   NaN   NaN  89.0
tripura   85.0   NaN   NaN   NaN
brahma     NaN   NaN   NaN   NaN
siva      79.0  90.0   NaN   NaN
vishnu    85.0  78.0   NaN   NaN
lakshmi   87.0   NaN   NaN  76.0
parvathi   NaN   NaN   NaN   NaN

In [72]:
marks.sub1['sushma']

83

In [73]:
marks.iloc[0][3]

98

In [74]:
marks.iloc[5]

sub1    68
sub2    68
sub3     7
sub4    45
Name: brahma, dtype: int64

In [76]:
marks

          sub1  sub2  sub3  sub4
kunu        99    99     3    98
teju        90    78     4    90
durga       98    89     5    78
sushma      83    56     2    89
tripura     85    34     3    67
brahma      68    68     7    45
siva        79    90     8    32
vishnu      85    78     4    67
lakshmi     87    56     2    76
parvathi    45    42     0    45

In [82]:
marks['sub5']=[10,12,15,17,19,18,32,20,7,8]
marks

          sub1  sub2  sub3  sub4  sub5
kunu        99    99     3    98    10
teju        90    78     4    90    12
durga       98    89     5    78    15
sushma      83    56     2    89    17
tripura     85    34     3    67    19
brahma      68    68     7    45    18
siva        79    90     8    32    32
vishnu      85    78     4    67    20
lakshmi     87    56     2    76     7
parvathi    45    42     0    45     8

In [83]:
# how to drop columns 
marks.drop(columns='sub5')

          sub1  sub2  sub3  sub4
kunu        99    99     3    98
teju        90    78     4    90
durga       98    89     5    78
sushma      83    56     2    89
tripura     85    34     3    67
brahma      68    68     7    45
siva        79    90     8    32
vishnu      85    78     4    67
lakshmi     87    56     2    76
parvathi    45    42     0    45

In [86]:
marks

          sub1  sub2  sub3  sub4  sub5
kunu        99    99     3    98    10
teju        90    78     4    90    12
durga       98    89     5    78    15
sushma      83    56     2    89    17
tripura     85    34     3    67    19
brahma      68    68     7    45    18
siva        79    90     8    32    32
vishnu      85    78     4    67    20
lakshmi     87    56     2    76     7
parvathi    45    42     0    45     8

In [87]:
marks

          sub1  sub2  sub3  sub4  sub5
kunu        99    99     3    98    10
teju        90    78     4    90    12
durga       98    89     5    78    15
sushma      83    56     2    89    17
tripura     85    34     3    67    19
brahma      68    68     7    45    18
siva        79    90     8    32    32
vishnu      85    78     4    67    20
lakshmi     87    56     2    76     7
parvathi    45    42     0    45     8

In [89]:

# how to drop columns 
marks.drop(columns='sub5',axis=1)

          sub1  sub2  sub3  sub4
kunu        99    99     3    98
teju        90    78     4    90
durga       98    89     5    78
sushma      83    56     2    89
tripura     85    34     3    67
brahma      68    68     7    45
siva        79    90     8    32
vishnu      85    78     4    67
lakshmi     87    56     2    76
parvathi    45    42     0    45

In [90]:
marks

          sub1  sub2  sub3  sub4  sub5
kunu        99    99     3    98    10
teju        90    78     4    90    12
durga       98    89     5    78    15
sushma      83    56     2    89    17
tripura     85    34     3    67    19
brahma      68    68     7    45    18
siva        79    90     8    32    32
vishnu      85    78     4    67    20
lakshmi     87    56     2    76     7
parvathi    45    42     0    45     8

In [ ]:
# how to drop columns 
marks.drop(columns='sub5',axis=1,inplace=True)

In [93]:
marks

          sub1  sub2  sub3  sub4
kunu        99    99     3    98
teju        90    78     4    90
durga       98    89     5    78
sushma      83    56     2    89
tripura     85    34     3    67
brahma      68    68     7    45
siva        79    90     8    32
vishnu      85    78     4    67
lakshmi     87    56     2    76
parvathi    45    42     0    45

In [95]:
marks.drop('sushma',inplace=True)

In [96]:
marks

          sub1  sub2  sub3  sub4
kunu        99    99     3    98
teju        90    78     4    90
durga       98    89     5    78
tripura     85    34     3    67
brahma      68    68     7    45
siva        79    90     8    32
vishnu      85    78     4    67
lakshmi     87    56     2    76
parvathi    45    42     0    45

In [97]:
marks.iloc[5][2]=20

In [98]:
marks

          sub1  sub2  sub3  sub4
kunu        99    99     3    98
teju        90    78     4    90
durga       98    89     5    78
tripura     85    34     3    67
brahma      68    68     7    45
siva        79    90    20    32
vishnu      85    78     4    67
lakshmi     87    56     2    76
parvathi    45    42     0    45

In [99]:
marks['sub3']=100

In [100]:
marks

          sub1  sub2  sub3  sub4
kunu        99    99   100    98
teju        90    78   100    90
durga       98    89   100    78
tripura     85    34   100    67
brahma      68    68   100    45
siva        79    90   100    32
vishnu      85    78   100    67
lakshmi     87    56   100    76
parvathi    45    42   100    45

In [101]:
marks.iloc[:][3]=90
marks

          sub1  sub2  sub3  sub4
kunu        99    99   100    98
teju        90    78   100    90
durga       98    89   100    78
tripura     85    34   100    67
brahma      68    68   100    45
siva        79    90   100    32
vishnu      85    78   100    67
lakshmi     87    56   100    76
parvathi    45    42   100    45

In [107]:
# read csv data from externalfilesw using nread_csv function
import pandas as pd
pop_data=pd.read_csv('population.csv')
pop_data

    2001   2002  2003  2004  2005  2006  2007  2008  2009   2010
0     91   91.5    90    95    92    96    98    94    97   99.6
1    120  121.9   125   130   131   120   130   131   134  137.0
2     91   91.5    90    95    92    96    98    94    97   99.6
3    120  121.9   125   130   131   120   130   131   134  137.0
4     91   91.5    90    95    92    96    98    94    97   99.6
5    120  121.9   125   130   131   120   130   131   134  137.0
6     91   91.5    90    95    92    96    98    94    97   99.6
7    120  121.9   125   130   131   120   130   131   134  137.0
8    120  121.9   125   130   131   120   130   131   134  137.0
9     91   91.5    90    95    92    96    98    94    97   99.6
10   120  121.9   125   130   131   120   130   131   134  137.0
11    91   91.5    90    95    92    96    98    94    97   99.6
12   120  121.9   125   130   131   120   130   131   134  137.0
13    91   91.5    90    95    92    96    98    94    97   99.6
14   120  121.9   125   130   131   120   130   131   134  137.0

In [108]:
pop_data

    2001   2002  2003  2004  2005  2006  2007  2008  2009   2010
0     91   91.5    90    95    92    96    98    94    97   99.6
1    120  121.9   125   130   131   120   130   131   134  137.0
2     91   91.5    90    95    92    96    98    94    97   99.6
3    120  121.9   125   130   131   120   130   131   134  137.0
4     91   91.5    90    95    92    96    98    94    97   99.6
5    120  121.9   125   130   131   120   130   131   134  137.0
6     91   91.5    90    95    92    96    98    94    97   99.6
7    120  121.9   125   130   131   120   130   131   134  137.0
8    120  121.9   125   130   131   120   130   131   134  137.0
9     91   91.5    90    95    92    96    98    94    97   99.6
10   120  121.9   125   130   131   120   130   131   134  137.0
11    91   91.5    90    95    92    96    98    94    97   99.6
12   120  121.9   125   130   131   120   130   131   134  137.0
13    91   91.5    90    95    92    96    98    94    97   99.6
14   120  121.9   125   130   131   120   130   131   134  137.0

In [114]:
pop_data.index=['India','China','Japan','Newzealand','Afganisthan','Dubai','USA','SouthKorea','North Korea','Sri Lanka','Canada','Phillippines','Brazil','cambodia','colombia']
pop_data

              2001   2002  2003  2004  2005  2006  2007  2008  2009   2010
India           91   91.5    90    95    92    96    98    94    97   99.6
China          120  121.9   125   130   131   120   130   131   134  137.0
Japan           91   91.5    90    95    92    96    98    94    97   99.6
Newzealand     120  121.9   125   130   131   120   130   131   134  137.0
Afganisthan     91   91.5    90    95    92    96    98    94    97   99.6
Dubai          120  121.9   125   130   131   120   130   131   134  137.0
USA             91   91.5    90    95    92    96    98    94    97   99.6
SouthKorea     120  121.9   125   130   131   120   130   131   134  137.0
North Korea    120  121.9   125   130   131   120   130   131   134  137.0
Sri Lanka       91   91.5    90    95    92    96    98    94    97   99.6
Canada         120  121.9   125   130   131   120   130   131   134  137.0
Phillippines    91   91.5    90    95    92    96    98    94    97   99.6
Brazil         120  121.9   125   130   131   120   130   131   134  137.0
cambodia        91   91.5    90    95    92    96    98    94    97   99.6
colombia       120  121.9   125   130   131   120   130   131   134  137.0

In [117]:
marks=pd.read_excel('marks.xlsx')
marks

  student name  sub1  sub2  sub3  sub4  sub5
0        alice    50    80    75    83    78
1          bob    50    80    75    83    78
2         bean    50    80    75    83    78
3          tom    50    80    75    83    78
4        jerry    50    80    75    83    78
5          eve    50    80    75    83    78
6        durga    50    80    75    83    78
7          sai    50    80    75    83    78
8          sri    50    80    75    83    78
9          ram    50    80    75    83    78